zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_common.h
/***************************************************************************//**
* \file cy_capsense_common.h
* \version 10.0.0
*
* \brief
* This file provides the common CAPSENSE&trade; middleware definitions.
*
********************************************************************************
* \copyright
* (c) 2018-2026, Infineon Technologies AG, or an affiliate of Infineon
* Technologies AG. All rights reserved.
* This software, associated documentation and materials ("Software") is
* owned by Infineon Technologies AG or one of its affiliates ("Infineon")
* and is protected by and subject to worldwide patent protection, worldwide
* copyright laws, and international treaty provisions. Therefore, you may use
* this Software only as provided in the license agreement accompanying the
* software package from which you obtained this Software. If no license
* agreement applies, then any use, reproduction, modification, translation, or
* compilation of this Software is prohibited without the express written
* permission of Infineon.
*
* Disclaimer: UNLESS OTHERWISE EXPRESSLY AGREED WITH INFINEON, THIS SOFTWARE
* IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
* INCLUDING, BUT NOT LIMITED TO, ALL WARRANTIES OF NON-INFRINGEMENT OF
* THIRD-PARTY RIGHTS AND IMPLIED WARRANTIES SUCH AS WARRANTIES OF FITNESS FOR A
* SPECIFIC USE/PURPOSE OR MERCHANTABILITY.
* Infineon reserves the right to make changes to the Software without notice.
* You are responsible for properly designing, programming, and testing the
* functionality and safety of your intended application of the Software, as
* well as complying with any legal requirements related to its use. Infineon
* does not guarantee that the Software will be free from intrusion, data theft
* or loss, or other breaches ("Security Breaches"), and Infineon shall have
* no liability arising out of any Security Breaches. Unless otherwise
* explicitly approved by Infineon, the Software may not be used in any
* application where a failure of the Product or any consequences of the use
* thereof can reasonably be expected to result in personal injury.
*******************************************************************************/


#if !defined(CY_CAPSENSE_COMMON_H)
#define CY_CAPSENSE_COMMON_H

#include "cy_device_headers.h"
#include "cy_sysint.h"
#include "cycfg_capsense_defines.h"

#if !defined (CY_CAPSENSE_WBX_CALIBRATION_EN)
#define CY_CAPSENSE_WBX_CALIBRATION_EN (1u)
#endif

#if (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2) || defined(CY_IP_M0S8MSCV3) || defined(CY_IP_M0S8MSCV3LP))

#if defined(__cplusplus)
extern "C" {
#endif

/*******************************************************************************
* Macros
*******************************************************************************/

#if (defined(CY_IP_M0S8CSDV2))

    #define CY_CAPSENSE_PLATFORM_DEVICE_PSOC4           (1u)
    #define CY_CAPSENSE_PLATFORM_DEVICE_PSOC6           (0u)

    #define CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN       (1u)
    #define CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN        (0u)
    #define CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP     (0u)

    #define CY_CAPSENSE_PSOC4_FOURTH_GEN                (1u)
    #define CY_CAPSENSE_PSOC6_FOURTH_GEN                (0u)
    #define CY_CAPSENSE_PSOC4_FIFTH_GEN                 (0u)
    #define CY_CAPSENSE_PSOC4_FIFTH_GEN_LP              (0u)

#elif (defined(CY_IP_MXCSDV2))

    #define CY_CAPSENSE_PLATFORM_DEVICE_PSOC4           (0u)
    #define CY_CAPSENSE_PLATFORM_DEVICE_PSOC6           (1u)

    #define CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN       (1u)
    #define CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN        (0u)
    #define CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP     (0u)

    #define CY_CAPSENSE_PSOC4_FOURTH_GEN                (0u)
    #define CY_CAPSENSE_PSOC6_FOURTH_GEN                (1u)
    #define CY_CAPSENSE_PSOC4_FIFTH_GEN                 (0u)
    #define CY_CAPSENSE_PSOC4_FIFTH_GEN_LP              (0u)

#elif (defined(CY_IP_M0S8MSCV3))

    #define CY_CAPSENSE_PLATFORM_DEVICE_PSOC4           (1u)
    #define CY_CAPSENSE_PLATFORM_DEVICE_PSOC6           (0u)

    #define CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN       (0u)
    #define CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN        (1u)
    #define CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP     (0u)

    #define CY_CAPSENSE_PSOC4_FOURTH_GEN                (0u)
    #define CY_CAPSENSE_PSOC6_FOURTH_GEN                (0u)
    #define CY_CAPSENSE_PSOC4_FIFTH_GEN                 (1u)
    #define CY_CAPSENSE_PSOC4_FIFTH_GEN_LP              (0u)

#elif (defined(CY_IP_M0S8MSCV3LP))

    #define CY_CAPSENSE_PLATFORM_DEVICE_PSOC4           (1u)
    #define CY_CAPSENSE_PLATFORM_DEVICE_PSOC6           (0u)

    #define CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN       (0u)
    #define CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN        (0u)
    #define CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP     (1u)

    #define CY_CAPSENSE_PSOC4_FOURTH_GEN                (0u)
    #define CY_CAPSENSE_PSOC6_FOURTH_GEN                (0u)
    #define CY_CAPSENSE_PSOC4_FIFTH_GEN                 (0u)
    #define CY_CAPSENSE_PSOC4_FIFTH_GEN_LP              (1u)

#endif

#define CY_CAPSENSE_PSOC4_CSDV2                         (CY_CAPSENSE_PSOC4_FOURTH_GEN)
#define CY_CAPSENSE_PSOC6_CSDV2                         (CY_CAPSENSE_PSOC6_FOURTH_GEN)

#if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
    #include "cy_csd.h"
#elif (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
    #include "cy_msclp.h"
#else /* (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) */
    #include "cy_msc.h"
#endif

/******************************************************************************/
/** \addtogroup group_capsense_macros_general *//** \{ */
/******************************************************************************/
/** Middleware major version */
#define CY_CAPSENSE_MW_VERSION_MAJOR                    (10)
/** Middleware minor version */
#define CY_CAPSENSE_MW_VERSION_MINOR                    (0)
/** Middleware patch version */
#define CY_CAPSENSE_MW_VERSION_PATCH                    (0)
/** Middleware version */
#define CY_CAPSENSE_MW_VERSION                          (1000)

#if (CY_CAPSENSE_PSOC6_FOURTH_GEN)
    /** Defined supported CSD driver version */
    #define CY_CSD_DRV_VERSION_REQUIRED                 (100)

    #if !defined (CY_CSD_DRV2_VERSION)
        /** If CSD driver version not defined by driver then define it here */
        #define CY_CSD_DRV2_VERSION                     (100)
    #else
        /** Use CSD Capture function */
        #define CY_CAPSENSE_USE_CAPTURE                 (1u)
    #endif

