zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_common.h
    /* Check used driver version */
    #if (CY_CSD_DRV_VERSION_REQUIRED > CY_CSD_DRV2_VERSION)
        #error Some of the features supported by the CAPSENSE&trade; Middleware version CY_CAPSENSE_MW_VERSION require newer version of the PDL. Update the PDL in your project.
    #endif

#endif

#if (CY_CAPSENSE_PSOC4_FOURTH_GEN)
    /** Defined supported CSD driver version */
    #define CY_CSD_DRV_VERSION_REQUIRED                 (100)

    #if !defined (CY_CSD_DRV2_VERSION)
        /** If CSD driver version not defined by driver then define it here */
        #define CY_CSD_DRV2_VERSION                     (100)
    #else
        /** Use CSD Capture function */
        #define CY_CAPSENSE_USE_CAPTURE                 (1u)
    #endif

    /* Check used driver version */
    #if (CY_CSD_DRV_VERSION_REQUIRED > CY_CSD_DRV2_VERSION)
        #error Some of the features supported by the CAPSENSE&trade; Middleware version CY_CAPSENSE_MW_VERSION require newer version of the PDL. Update the PDL in your project.
    #endif

#endif

#if (CY_CAPSENSE_PSOC4_FIFTH_GEN)
    /** Defined supported MSC driver version */
    #define CY_MSC_DRV_VERSION_REQUIRED                 (100)

    #if !defined (CY_MSC_DRV2_VERSION)
        /** If MSC driver version not defined by driver then define it here */
        #define CY_MSC_DRV2_VERSION                     (100)
    #else
        /** Use MSC Capture function */
        #define CY_CAPSENSE_USE_CAPTURE                 (1u)
    #endif

    /* Check used driver version */
    #if (CY_MSC_DRV_VERSION_REQUIRED > CY_MSC_DRV2_VERSION)
        #error Some of the features supported by the CAPSENSE&trade; Middleware version CY_CAPSENSE_MW_VERSION require newer version of the PDL. Update the PDL in your project.
    #endif

#endif

#if (CY_CAPSENSE_PSOC4_FIFTH_GEN_LP)
    #define CY_CAPSENSE_USE_CAPTURE                     (1u)
#endif

#if !defined (CY_CAPSENSE_USE_CAPTURE)
    /** Use CSD/MSC Init function */
    #define CY_CAPSENSE_USE_CAPTURE                     (0u)
#endif

/** Middleware ID */
#define CY_CAPSENSE_ID                                  (CY_PDL_DRV_ID(0x07uL))

/** CAPSENSE&trade; MW initialization is done */
#define CY_CAPSENSE_INIT_DONE                           (1u)
/** CAPSENSE&trade; MW initialization is needed */
#define CY_CAPSENSE_INIT_NEEDED                         (0u)

/** Feature enabled */
#define CY_CAPSENSE_ENABLE                              (1u)
/** Feature disabled */
#define CY_CAPSENSE_DISABLE                             (0u)

/** Regular Sensor active status mask */
#define CY_CAPSENSE_SNS_TOUCH_STATUS_MASK               (0x01u)
/** Proximity Sensor active status mask */
#define CY_CAPSENSE_SNS_PROX_STATUS_MASK                (0x01u)
/** Proximity Sensor touch active status mask */
#define CY_CAPSENSE_SNS_TOUCH_PROX_STATUS_MASK          (0x02u)
/** Sensor overflow mask */
#define CY_CAPSENSE_SNS_OVERFLOW_MASK                   (0x04u)

/** Maximum widget number */
#define CY_CAPSENSE_WD_MAX_NUMBER                       (64u)
/** Maximum widget number mask */
#define CY_CAPSENSE_WD_MAX_NUMBER_MASK                  (0x3Fu)
/** Widget active status mask */
#define CY_CAPSENSE_WD_ACTIVE_MASK                      (0x01u)
/** Widget enable status mask */
#define CY_CAPSENSE_WD_ENABLE_MASK                      (0x02u)
/** Widget working status mask */
#define CY_CAPSENSE_WD_WORKING_MASK                     (0x04u)
/** Widget maximum raw count calculation enable mask */
#define CY_CAPSENSE_WD_MAXCOUNT_CALC_MASK               (0x08u)
/** Widget row maximum raw count calculation enable mask */
#define CY_CAPSENSE_WD_MAXCOUNT_ROW_CALC_MASK           (0x10u)
/** Widget compensation CDAC direction mask: direct (like CSD) or inverse */
#define CY_CAPSENSE_WD_WBX_COMPENSATION_DIRECTION_MASK  (0x20u)
/** Widget calibration mask: performs CDAC auto-calibration even 
  * CY_CAPSENSE_TUNING_COMPLETED_MASK is set */
#define CY_CAPSENSE_WD_FACTORY_CALIBRATION_MASK         (0x40u)
/** Widget tank removal detection mask */
#define CY_CAPSENSE_WD_TANK_REMOVAL_DETECTION_MASK      (0x80u)
/** Liquid presence level 1 mask */
#define CY_CAPSENSE_WD_LIQUID_PRESENCE_LEVEL1_MASK      (0x100u)
/** Liquid presence level 2 mask */
#define CY_CAPSENSE_WD_LIQUID_PRESENCE_LEVEL2_MASK      (0x200u)
/** Liquid presence level 3 mask */
#define CY_CAPSENSE_WD_LIQUID_PRESENCE_LEVEL3_MASK      (0x400u)
/** Widget finger type mask */
#define CY_CAPSENSE_WD_FINGER_TYPE_MASK                 (0x3800u)
/** Widget finger type position */
#define CY_CAPSENSE_WD_FINGER_TYPE_POS                  (11u)
/** \} */

/******************************************************************************/
/** \addtogroup group_capsense_macros_mw_state *//** \{ */
/******************************************************************************/
/** The CAPSENSE&trade; middleware is busy */
#define CY_CAPSENSE_BUSY                                (0x80u)
/** The CAPSENSE&trade; middleware is not busy */
#define CY_CAPSENSE_NOT_BUSY                            (0x00u)

#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
    /** The CAPSENSE&trade; middleware busy mask */
    #define CY_CAPSENSE_BUSY_MASK                       (0xFFu)
    /** The MSCv3 channel busy mask */
    #define CY_CAPSENSE_BUSY_CH_MASK                    (0x01u)
    /** All MSCv3 channels busy mask */
    #define CY_CAPSENSE_BUSY_ALL_CH_MASK                (0x0Fu)
#endif

/** There was any sensor touch detected at the previous low power widget scan */
#define CY_CAPSENSE_MW_STATE_LP_ACTIVE_MASK             (0x400u)
/** The BIST is currently in progress */
#define CY_CAPSENSE_MW_STATE_BIST_MASK                  (0x800u)
/** The auto-calibration in Single CDAC mode */
#define CY_CAPSENSE_MW_STATE_CALIBRATION_SINGLE_MASK    (0x1000u)
/** The auto-calibration is currently in progress */
#define CY_CAPSENSE_MW_STATE_CALIBRATION_MASK           (0x2000u)
/** The smart sensing algorithm is currently in progress */
#define CY_CAPSENSE_MW_STATE_SMARTSENSE_MASK            (0x4000u)
/** The middleware initialization is currently in progress */
#define CY_CAPSENSE_MW_STATE_INITIALIZATION_MASK        (0x8000u)
/** The currently active or last scanned slot ID mask */
#define CY_CAPSENSE_MW_STATE_SCAN_SLOT_MASK             (0xFFFF0000u)
/** Current scan slot position in status */
#define CY_CAPSENSE_MW_STATE_SCAN_SLOT_POS              (16u)
/** Calibration Enabled */
#define CY_CAPSENSE_CALIBRATION_EN                      (CY_CAPSENSE_CSD_CALIBRATION_EN | \
                                                         CY_CAPSENSE_CSX_CALIBRATION_EN | \
                                                         CY_CAPSENSE_ISX_CALIBRATION_EN | \
                                                         CY_CAPSENSE_WBX_CALIBRATION_EN)

#if (CY_CAPSENSE_PSOC4_FIFTH_GEN_LP)
    /** The last or currently scanned widget type is Active widget
     *  * \note This macro is available only for the fifth-generation low power CAPSENSE&trade;.
     */
    #define CY_CAPSENSE_MW_STATE_ACTIVE_WD_SCAN_MASK       (0x10u)
    /** The last or currently scanned widget type is Low Power widget
     *  * \note This macro is available only for the fifth-generation low power CAPSENSE&trade;.
     */
    #define CY_CAPSENSE_MW_STATE_LP_WD_SCAN_MASK           (0x20u)
    /** The mask for the last or currently scanned widget type
     *  * \note This macro is available only for the fifth-generation low power CAPSENSE&trade;.
     */
    #define CY_CAPSENSE_MW_STATE_WD_SCAN_MASK              (0x30u)
#endif
/** \} */


/******************************************************************************/
/** \addtogroup group_capsense_macros_ext_cref *//** \{ */
/******************************************************************************/
/** External Cref enable macro (fifth-generation CAPSENSE&trade; PSOC&trade; 4 HVMS only) */
#define CY_CAPSENSE_EXT_CREF_EN                         (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN && \
                                                         CY_CAPSENSE_EXT_CREF_FEATURE_EN)

#if (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE)
    /** Internal CDAC used as Cref source */
    #define CY_CAPSENSE_CREF_SOURCE_INTERNAL            (0u)
    /** External capacitor used as Cref source */
    #define CY_CAPSENSE_CREF_SOURCE_EXTERNAL            (1u)
    /** Index of the CREF0 pin in the External Cref pin configuration array */
    #define CY_CAPSENSE_PIN_IDX_EXT_CREF0               (0u)
    /** Index of the CREF1 pin in the External Cref pin configuration array */
    #define CY_CAPSENSE_PIN_IDX_EXT_CREF1               (1u)
#endif /* (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_ENABLE) */
/** \} */

/******************************************************************************/
/** \addtogroup group_capsense_macros_settings *//** \{ */
/******************************************************************************/

/** Interrupt Driven scanning mode */
#define CY_CAPSENSE_SCAN_MODE_INT_DRIVEN                (0u)
/** DMA Driven scanning mode */
#define CY_CAPSENSE_SCAN_MODE_DMA_DRIVEN                (1u)

/** Sensor connection method through analog mux bus */
#define CY_CAPSENSE_AMUX_SENSOR_CONNECTION_METHOD       (0u)
/** Sensor connection method through control mux switches */
#define CY_CAPSENSE_CTRLMUX_SENSOR_CONNECTION_METHOD    (1u)

/** CIC filter mode */
#define CY_CAPSENSE_CIC_FILTER                          (0u)
/** CIC2 filter mode */
#define CY_CAPSENSE_CIC2_FILTER                         (1u)
/** Maximum CIC2 Decimation Rate */
#define CY_CAPSENSE_MAX_DECIMATION_RATE                 (255u)
/** CIC2 filter minimum valid sample number */
#define CY_CAPSENSE_CIC2_MIN_VALID_SAMPLES              (2u)
/** CIC2 filter maximum valid sample number */
#define CY_CAPSENSE_CIC2_MAX_VALID_SAMPLES              (515u)

/** Raw count counter mode saturate */
#define CY_CAPSENSE_COUNTER_MODE_SATURATE               (0u)
/** Raw count counter mode overflow */
#define CY_CAPSENSE_COUNTER_MODE_OVERFLOW               (1u)

/** Synchronization mode is disabled */
#define CY_CAPSENSE_SYNC_MODE_OFF                       (0u)
/** Synchronization is external */
#define CY_CAPSENSE_SYNC_EXTERNAL                       (1u)
/** Synchronization is internal */
#define CY_CAPSENSE_SYNC_INTERNAL                       (2u)

