zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_common.h
/** Sensing group undefined used at initialization */
#define CY_CAPSENSE_UNDEFINED_GROUP                     (0u)
/** CSD sensing group */
#define CY_CAPSENSE_CSD_GROUP                           (1u)
/** CSX sensing group */
#define CY_CAPSENSE_CSX_GROUP                           (2u)
/** BIST group */
#define CY_CAPSENSE_BIST_GROUP                          (3u)
/** BIST CSD sensor capacitance measurement group */
#define CY_CAPSENSE_BIST_CSD_GROUP                      (4u)
/** BIST CSX sensor capacitance measurement group */
#define CY_CAPSENSE_BIST_CSX_GROUP                      (5u)
/** BIST shield capacitance measurement group */
#define CY_CAPSENSE_BIST_SHIELD_GROUP                   (6u)
/** ISX sensing group */
#define CY_CAPSENSE_ISX_GROUP                           (10u)
/** MPSC-D sensing group */
#define CY_CAPSENSE_MPSC_GROUP                          (11u)
/** Wheatstone bridge sensing group */
#define CY_CAPSENSE_WBX_GROUP                           (12u)

#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
    /** Total number of mode templates */
    #define CY_CAPSENSE_REG_MODE_NUMBER                 (7u)
    /** Total number of mode templates used  in lookup table */
    #define CY_CAPSENSE_REG_MODE_ARRAY_NUMBER           (4u)
#else /* CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN */
    /** Total number of mode templates */
    #define CY_CAPSENSE_REG_MODE_NUMBER                 (4u)
#endif

/* The values of these macros should be not changed due to CY_ID374670 */

/* Initialization Group */
/** Pin function undefined */
#define CY_CAPSENSE_SCW_FUNC_PIN_STATE_IDX_UNDEFINED    (255u)
/** Control mux switch state is ground */
#define CY_CAPSENSE_CTRLMUX_PIN_STATE_GND               (0u)
/** Control mux switch state is High-Z */
#define CY_CAPSENSE_CTRLMUX_PIN_STATE_HIGH_Z            (1u)
/** Control mux switch state defined as CSX Tx electrode */
#define CY_CAPSENSE_CTRLMUX_PIN_STATE_TX                (2u)
#if (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_DISABLE)
/** Control mux switch state defined as CSX Negative Tx electrode */
#define CY_CAPSENSE_CTRLMUX_PIN_STATE_TX_NEGATIVE       (4u)
#else
/** Control mux switch state defined as External Cref pin 0 (replaces TX_NEGATIVE) */
#define CY_CAPSENSE_CTRLMUX_PIN_STATE_EXT_CREF0         (4u)
#endif
/* Working Group */
/** Control mux switch state defined as CSX Rx electrode */
#define CY_CAPSENSE_CTRLMUX_PIN_STATE_RX                (3u)
/** Control mux switch state defined as CSD sensor */
#define CY_CAPSENSE_CTRLMUX_PIN_STATE_SNS               (5u)
/** Control mux switch state defined as connection to shield signal */
#define CY_CAPSENSE_CTRLMUX_PIN_STATE_SHIELD            (6u)
/* Corner Group */
#if (CY_CAPSENSE_EXT_CREF_EN == CY_CAPSENSE_DISABLE)
/** Control mux switch state defined as CSDBUSC connected electrode */
#define CY_CAPSENSE_CTRLMUX_PIN_STATE_VDDA2             (7u)
#else
/** Control mux switch state defined as External Cref pin 1 (replaces VDDA2) */
#define CY_CAPSENSE_CTRLMUX_PIN_STATE_EXT_CREF1         (7u)
#endif

#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
/** Pin function undefined */
#define CY_CAPSENSE_PIN_STATE_IDX_UNDEFINED             (255u)
/** Pin function is ground */
#define CY_CAPSENSE_PIN_STATE_IDX_GND                   (0u)
/** Pin function is High-Z */
#define CY_CAPSENSE_PIN_STATE_IDX_HIGH_Z                (1u)
/** Pin function is CSX Rx electrode */
#define CY_CAPSENSE_PIN_STATE_IDX_CSX_RX                (2u)
/** Pin function is CSX Tx electrode */
#define CY_CAPSENSE_PIN_STATE_IDX_CSX_TX                (3u)
/** Pin function is CSX Negative Tx electrode */
#define CY_CAPSENSE_PIN_STATE_IDX_CSX_NEG_TX            (4u)
/** Pin function is CSD sensor */
#define CY_CAPSENSE_PIN_STATE_IDX_CSD_SNS               (5u)
/** Pin function is ISX Lx electrode */
#define CY_CAPSENSE_PIN_STATE_IDX_ISX_LX                (6u)
/** Pin function is ISX Rx electrode */
#define CY_CAPSENSE_PIN_STATE_IDX_ISX_RX                (7u)
/** Pin function is Active shield */
#define CY_CAPSENSE_PIN_STATE_IDX_ACT_SHIELD            (8u)
/** Pin function is Passive shield */
#define CY_CAPSENSE_PIN_STATE_IDX_PAS_SHIELD            (9u)
/** Pin function is CSX VDDA/2 connection */
#define CY_CAPSENSE_PIN_STATE_IDX_CSX_VDDA2             (10u)
/** Pin function is MPSC CSP connection */
#define CY_CAPSENSE_PIN_STATE_IDX_MPSC_CSP              (11u)
/** Pin function is MPSC CSN connection */
#define CY_CAPSENSE_PIN_STATE_IDX_MPSC_CSN              (12u)
/** Pin function is MPSC CSZ connection */
#define CY_CAPSENSE_PIN_STATE_IDX_MPSC_CSZ              (13u)
/** Pin function is WBX Node A connection */
#define CY_CAPSENSE_PIN_STATE_WBX_NODE_A                (14u)
/** Pin function is WBX Node B connection */
#define CY_CAPSENSE_PIN_STATE_WBX_NODE_B                (15u)

/** Number of CTRLMUX Pin States for LP */
#define CY_CAPSENSE_CTRLMUX_PIN_STATE_NUMBER            (16u)

#else /* All the rest platforms */

/** Number of CTRLMUX Pin State */
#define CY_CAPSENSE_CTRLMUX_PIN_STATE_NUMBER            (8u)
#endif /* CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP */

/** Number of CTRLMUX Pin State MASK registers */
#define CY_CAPSENSE_CTRLMUX_PIN_STATE_MASK_NUMBER       (3u)

/* MFS macros */
/** Number of multi-frequency scan channels */
#define CY_CAPSENSE_MAX_SUPPORTED_FREQ_NUM              (3u)
/** Total number of multi-frequency scan channels */
#if (CY_CAPSENSE_ENABLE == CY_CAPSENSE_MULTI_FREQUENCY_SCAN_EN)
    #define CY_CAPSENSE_CONFIGURED_FREQ_NUM             (3u)
#else
    #define CY_CAPSENSE_CONFIGURED_FREQ_NUM             (1u)
#endif
/** Multi-frequency channel 0 constant */
#define CY_CAPSENSE_MFS_CH0_INDEX                       (0u)
/** Multi-frequency channel 1 constant */
#define CY_CAPSENSE_MFS_CH1_INDEX                       (1u)
/** Multi-frequency channel 2 constant */
#define CY_CAPSENSE_MFS_CH2_INDEX                       (2u)
/** Multi-frequency channel number mask */
#define CY_CAPSENSE_MFS_FREQ_CHANNELS_NUM_MASK          (0xFu)
/** Multi-frequency enable mask */
#define CY_CAPSENSE_MFS_EN_MASK                         (0x10u)
/** Multi-frequency channels position */
#define CY_CAPSENSE_MFS_WIDGET_FREQ_ALL_CH_POS          (0x05u)
/** Multi-frequency channels mask */
#define CY_CAPSENSE_MFS_WIDGET_FREQ_ALL_CH_MASK         (0x60u)
/** Multi-frequency channel 1 mask */
#define CY_CAPSENSE_MFS_WIDGET_FREQ_CH_1_MASK           (0x20u)
/** Multi-frequency channel 2 mask */
#define CY_CAPSENSE_MFS_WIDGET_FREQ_CH_2_MASK           (0x40u)

/* Inactive sensor connection options */
/** Inactive sensor connection undefined */
#define CY_CAPSENSE_SNS_CONNECTION_UNDEFINED            (0u)
/** Inactive sensor connection to ground */
#define CY_CAPSENSE_SNS_CONNECTION_GROUND               (1u)
/** Inactive sensor connection to High-Z */
#define CY_CAPSENSE_SNS_CONNECTION_HIGHZ                (2u)
/** Inactive sensor connection to shield */
#define CY_CAPSENSE_SNS_CONNECTION_SHIELD               (4u)
/** Inactive CSX sensor connection to VDDA/2 voltage driven bus
 *  \note This field is available only for the fifth-generation CAPSENSE&trade;.
 */
#define CY_CAPSENSE_SNS_CONNECTION_VDDA_BY_2            (5u)

#if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
/* Shield electrode delay macros */
/** No shield signal delay */
#define CY_CAPSENSE_SH_DELAY_0NS                        (0u)
/** Shield signal delay > 5 ns */
#define CY_CAPSENSE_SH_DELAY_5NS                        (1u)
/** Shield signal delay > 10 ns */
#define CY_CAPSENSE_SH_DELAY_10NS                       (2u)
/** Shield signal delay > 20 ns */
#define CY_CAPSENSE_SH_DELAY_20NS                       (3u)

