zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_common.h
/** Voltage limit to switch to low-voltage configuration */
#define CY_CAPSENSE_LOW_VOLTAGE_LIMIT                   (2000u)

/* Position Filter Configuration */
/** Mask of all filters enabling */
#define CY_CAPSENSE_POSITION_FILTERS_MASK               (0x000000FFu)
/** Median position filter enable mask */
#define CY_CAPSENSE_POSITION_MED_MASK                   (0x00000001u)
/** IIR position filter enable mask */
#define CY_CAPSENSE_POSITION_IIR_MASK                   (0x00000002u)
/** Adaptive IIR position filter enable mask */
#define CY_CAPSENSE_POSITION_AIIR_MASK                  (0x00000004u)
/** Average position filter enable mask */
#define CY_CAPSENSE_POSITION_AVG_MASK                   (0x00000008u)
/** Jitter position filter enable mask */
#define CY_CAPSENSE_POSITION_JIT_MASK                   (0x00000010u)
/** Mask of position filters history size */
#define CY_CAPSENSE_POSITION_FILTERS_SIZE_MASK          (0x0000FF00u)
/** Offset of position filters history size */
#define CY_CAPSENSE_POSITION_FILTERS_SIZE_OFFSET        (8u)
/** Mask of IIR coefficient of position filter */
#define CY_CAPSENSE_POSITION_IIR_COEFF_MASK             (0x00FF0000u)
/** Offset of IIR coefficient of position filter */
#define CY_CAPSENSE_POSITION_IIR_COEFF_OFFSET           (16u)

/* Raw count filter macros */
/** Offset of raw count filter history size */
#define CY_CAPSENSE_RC_FILTER_SNS_HISTORY_SIZE_OFFSET    (0u)
/** Offset of raw count median filter enable mask */
#define CY_CAPSENSE_RC_FILTER_MEDIAN_EN_OFFSET           (4u)
/** Offset of raw count median filter mode mask */
#define CY_CAPSENSE_RC_FILTER_MEDIAN_MODE_OFFSET         (5u)
/** Offset of raw count IIR filter enable mask */
#define CY_CAPSENSE_RC_FILTER_IIR_EN_OFFSET              (7u)
/** Offset of raw count IIR filter mode mask */
#define CY_CAPSENSE_RC_FILTER_IIR_MODE_OFFSET            (8u)
/** Offset of raw count average filter enable mask */
#define CY_CAPSENSE_RC_FILTER_AVERAGE_EN_OFFSET          (10u)
/** Offset of raw count average filter mode mask */
#define CY_CAPSENSE_RC_FILTER_AVERAGE_MODE_OFFSET        (11u)
/** Offset of raw count HW IIR filter enable mask */
#define CY_CAPSENSE_RC_HW_IIR_FILTER_EN_OFFSET           (13u)
/** Offset of raw count CM filter enable mask */
#define CY_CAPSENSE_RC_FILTER_CM_EN_OFFSET               (14u)
/** Offset of raw count ALP filter enable mask */
#define CY_CAPSENSE_RC_FILTER_ALP_EN_OFFSET              (15u)

/** Mask of raw count filter history size */
#define CY_CAPSENSE_RC_FILTER_SNS_HISTORY_SIZE_MASK     ((uint32_t)(0x000FuL << CY_CAPSENSE_RC_FILTER_SNS_HISTORY_SIZE_OFFSET))
/** Median raw count filter enable mask */
#define CY_CAPSENSE_RC_FILTER_MEDIAN_EN_MASK            ((uint32_t)(0x0001uL << CY_CAPSENSE_RC_FILTER_MEDIAN_EN_OFFSET))
/** Median raw count filter mode mask */
#define CY_CAPSENSE_RC_FILTER_MEDIAN_MODE_MASK          ((uint32_t)(0x0003uL << CY_CAPSENSE_RC_FILTER_MEDIAN_MODE_OFFSET))
/** IIR raw count filter enable mask */
#define CY_CAPSENSE_RC_FILTER_IIR_EN_MASK               ((uint32_t)(0x0001uL << CY_CAPSENSE_RC_FILTER_IIR_EN_OFFSET))
/** IIR raw count filter mode mask */
#define CY_CAPSENSE_RC_FILTER_IIR_MODE_MASK             ((uint32_t)(0x0003uL << CY_CAPSENSE_RC_FILTER_IIR_MODE_OFFSET))
/** Average raw count filter enable mask */
#define CY_CAPSENSE_RC_FILTER_AVERAGE_EN_MASK           ((uint32_t)(0x0001uL << CY_CAPSENSE_RC_FILTER_AVERAGE_EN_OFFSET))
/** Average raw count filter mode mask */
#define CY_CAPSENSE_RC_FILTER_AVERAGE_MODE_MASK         ((uint32_t)(0x0003uL << CY_CAPSENSE_RC_FILTER_AVERAGE_MODE_OFFSET))
/** Raw count HW IIR filter enable mask */
#define CY_CAPSENSE_RC_HW_IIR_FILTER_EN_MASK            ((uint32_t)(0x0001uL << CY_CAPSENSE_RC_HW_IIR_FILTER_EN_OFFSET))
/** Raw count CM filter enable mask */
#define CY_CAPSENSE_RC_FILTER_CM_EN_MASK                ((uint32_t)(0x0001uL << CY_CAPSENSE_RC_FILTER_CM_EN_OFFSET))
/** Raw count ALP filter enable mask */
#define CY_CAPSENSE_RC_FILTER_ALP_EN_MASK               ((uint32_t)(0x0001uL << CY_CAPSENSE_RC_FILTER_ALP_EN_OFFSET))
/** All raw count filters enable mask */
#define CY_CAPSENSE_RC_FILTER_ALL_EN_MASK               (CY_CAPSENSE_RC_FILTER_MEDIAN_EN_MASK |\
                                                         CY_CAPSENSE_RC_FILTER_IIR_EN_MASK |\
                                                         CY_CAPSENSE_RC_FILTER_AVERAGE_EN_OFFSET)
/** Raw count IIR filter mode standard */
#define CY_CAPSENSE_IIR_FILTER_STANDARD                 ((uint32_t)(1uL << CY_CAPSENSE_RC_FILTER_IIR_MODE_OFFSET))
/** Raw count IIR filter mode performance */
#define CY_CAPSENSE_IIR_FILTER_PERFORMANCE              ((uint32_t)(2uL << CY_CAPSENSE_RC_FILTER_IIR_MODE_OFFSET))
/** Raw count average filter mode */
#define CY_CAPSENSE_AVERAGE_FILTER_LEN_4                ((uint32_t)(2uL << CY_CAPSENSE_RC_FILTER_AVERAGE_MODE_OFFSET))
/** \} */

/* Slot configuration */
/** Shield only slot, can be assigned to the \ref cy_stc_capsense_scan_slot_t::wdId */
#define CY_CAPSENSE_SLOT_SHIELD_ONLY                    (0xFFFDu)
/** TX only slot, can be assigned to the \ref cy_stc_capsense_scan_slot_t::wdId */
#define CY_CAPSENSE_SLOT_TX_ONLY                        (0xFFFEu)
/** Empty slot, can be assigned to the \ref cy_stc_capsense_scan_slot_t::wdId */
#define CY_CAPSENSE_SLOT_EMPTY                          (0xFFFFu)

/* Centroid configuration */
/** Supported touch count mask */
#define CY_CAPSENSE_CENTROID_NUMBER_MASK                (0x0003u)
/** Diplex enable mask */
#define CY_CAPSENSE_DIPLEXING_MASK                      (0x0004u)
/** Ballistic multiplier enable mask */
#define CY_CAPSENSE_CENTROID_BALLISTIC_MASK             (0x0008u)
/** 3x3 centroid enable mask */
#define CY_CAPSENSE_CENTROID_3X3_MASK                   (0x0020u)
/** 5x5 centroid enable mask */
#define CY_CAPSENSE_CENTROID_5X5_MASK                   (0x0040u)
/** Edge correction enable mask */
#define CY_CAPSENSE_EDGE_CORRECTION_MASK                (0x0080u)
/**
* Centroid calculation method mask
* * Direct provides correct calculation but worse linearity on edges
*   and requires edge correction [MaxPosition / (numSns)]
* * Approximate provides better linearity on edges that leads to
*   worse accuracy in general [MaxPosition / (numSns - 1u)]
*/
#define CY_CAPSENSE_CALC_METHOD_MASK                    (0x0100u)
/** Liquid level foam sub-widget enable mask */
#define CY_CAPSENSE_LLW_FOAM_EN_MASK                    (0x0010u)
/** Liquid level tuning completed mask */
#define CY_CAPSENSE_LLW_TUNING_COMPLETED_MASK           (0x0200u)
/** Liquid level machine learning complete mask */
#define CY_CAPSENSE_LLW_LEARNING_COMPLETED_MASK         (0x0400u)
/** Liquid level tuning and machine learning complete mask */
#define CY_CAPSENSE_LLW_READY_MASK                      ((CY_CAPSENSE_LLW_TUNING_COMPLETED_MASK) | \
                                                         (CY_CAPSENSE_LLW_LEARNING_COMPLETED_MASK))
/** Liquid level multi level mask */
#define CY_CAPSENSE_LLW_MULTI_LEVEL_MASK                (0x1800u)
/** Liquid level multi level position */
#define CY_CAPSENSE_LLW_MULTI_LEVEL_POS                 (11u)
/** Finger type detection enable mask */
#define CY_CAPSENSE_FINGER_TYPE_DETECTION_MASK          (0x2000u)

/******************************************************************************/
/** \addtogroup group_capsense_macros_touch *//** \{ */
/******************************************************************************/
/** No touch detected */
#define CY_CAPSENSE_POSITION_NONE                       (0x00u)
/** One finger touch detected */
#define CY_CAPSENSE_POSITION_ONE                        (0x01u)
/** Two finger touches detected */
#define CY_CAPSENSE_POSITION_TWO                        (0x02u)
/** Three finger touches detected */
#define CY_CAPSENSE_POSITION_THREE                      (0x03u)
/** Multiple touches detected that exceed number of supported touches */
#define CY_CAPSENSE_POSITION_MULTIPLE                   (0xFFu)
/** Maximum possible centroid number */
#define CY_CAPSENSE_MAX_CENTROIDS                       (3u)
/** Invalid value returned by \ref Cy_CapSense_GetLiquidWidgetPosition,
 *  \ref Cy_CapSense_GetLiquidPresenceLevel, and Cy_CapSense_GetFoamWidgetPosition()
 *  when a wrong widgetId is specified or the widget is not of the expected
 *  liquid level or liquid presence type */
#define CY_CAPSENSE_LLS_INVALID                         (0xFFFFu)
/** Maximum number of peaks in CSX Touchpad */
#define CY_CAPSENSE_CSX_TOUCHPAD_MAX_PEAKS              (5u)
/** Maximum age of a touch */
#define CY_CAPSENSE_CSX_TOUCHPAD_MAX_AGE                (0xFFu)
/** Undefined ID */
#define CY_CAPSENSE_CSX_TOUCHPAD_ID_UNDEFINED           (0x80u)
/** Non-assigned ID */
#define CY_CAPSENSE_CSX_TOUCHPAD_ID_ABSENT              (0x40u)
/** Touch below threshold ID */
#define CY_CAPSENSE_CSX_TOUCHPAD_ID_ON_FAIL             (0x20u)
/** Minimum ID */
#define CY_CAPSENSE_CSX_TOUCHPAD_ID_MIN                 (0u)
/** Maximum ID */
#define CY_CAPSENSE_CSX_TOUCHPAD_ID_MAX                 (7u)
/** ID mask */
#define CY_CAPSENSE_CSX_TOUCHPAD_ID_MASK                (0x00FFu)
/** Touch power mask */
#define CY_CAPSENSE_CSX_TOUCHPAD_Z_MASK                 (0x00FFu)
/** Age mask */
#define CY_CAPSENSE_CSX_TOUCHPAD_AGE_MASK               (0xFF00u)
/** Debounce mask */
#define CY_CAPSENSE_CSX_TOUCHPAD_DEBOUNCE_MASK          (0xFF00u)
/** \} */

/******************************************************************************/
/** \addtogroup group_capsense_macros_liquid_presence *//** \{ */
/******************************************************************************/
/** No liquid presence level detected */
#define CY_CAPSENSE_LIQUID_PRESENCE_LEVEL_NONE           (0u)
/** Liquid presence level 1 detected */
#define CY_CAPSENSE_LIQUID_PRESENCE_LEVEL1               (1u)
/** Liquid presence level 2 detected */
#define CY_CAPSENSE_LIQUID_PRESENCE_LEVEL2               (2u)
/** Liquid presence level 3 detected */
#define CY_CAPSENSE_LIQUID_PRESENCE_LEVEL3               (3u)
/** \} */

/******************************************************************************/
/** \addtogroup group_capsense_macros_finger_type *//** \{ */
/******************************************************************************/
/** Finger type not detected */
#define CY_CAPSENSE_FINGER_TYPE_NONE                    (0u)
/** Normal finger type */
#define CY_CAPSENSE_FINGER_TYPE_NORMAL                  (1u)
/** Fat finger type */
#define CY_CAPSENSE_FINGER_TYPE_FAT                     (2u)
/** Large object finger type */
#define CY_CAPSENSE_FINGER_TYPE_LARGE_OBJECT            (3u)
/** \} */

/******************************************************************************/
/** \addtogroup group_capsense_macros_process *//** \{ */
/******************************************************************************/
/** Applies all enabled filters in the default order to the raw counts */
#define CY_CAPSENSE_PROCESS_FILTER                      (0x01u)
/** Updates baselines using current raw count values for the widget/sensor */
#define CY_CAPSENSE_PROCESS_BASELINE                    (0x02u)
/** Calculates differences for the widget/sensor */
#define CY_CAPSENSE_PROCESS_DIFFCOUNTS                  (0x04u)
/** Runs the noise envelope filter to measure noise magnitude for the widget/sensor */
#define CY_CAPSENSE_PROCESS_CALC_NOISE                  (0x08u)
/** Updates widget thresholds based on raw counts noise magnitude */
#define CY_CAPSENSE_PROCESS_THRESHOLDS                  (0x10u)
/** Runs the widget-specific processing algorithms and updates it status */
#define CY_CAPSENSE_PROCESS_STATUS                      (0x20u)
/** Applies median filter for MFS widget raw counts (applicable only for fifth-generation CAPSENSE&trade;) */
#define CY_CAPSENSE_PROCESS_MFS_FILTER                  (0x40u)
/** Definition that combines all possible processing tasks */
#define CY_CAPSENSE_PROCESS_ALL                         (CY_CAPSENSE_PROCESS_FILTER | \
                                                         CY_CAPSENSE_PROCESS_BASELINE | \
                                                         CY_CAPSENSE_PROCESS_DIFFCOUNTS | \
                                                         CY_CAPSENSE_PROCESS_CALC_NOISE | \
                                                         CY_CAPSENSE_PROCESS_THRESHOLDS | \
                                                         CY_CAPSENSE_PROCESS_STATUS | \
                                                         CY_CAPSENSE_PROCESS_MFS_FILTER)
/** Multi-phase TX min order */
#define CY_CAPSENSE_MPTX_MIN_ORDER                      (4u)
/** Multi-phase TX max order */
#define CY_CAPSENSE_MPTX_MAX_ORDER                      (32u)

/** Multi-phase Self-Cap min order */
#define CY_CAPSENSE_MPSC_MIN_ORDER                      (5u)
/** Multi-phase Self-Cap max order */
#define CY_CAPSENSE_MPSC_MAX_ORDER                      (32u)

/** Multi-phase max order */
#define CY_CAPSENSE_MULTIPHASE_MAX_ORDER                (32u)
/** \} */

/******************************************************************************/
/** \addtogroup group_capsense_macros_pin *//** \{ */
/******************************************************************************/
/** Connection of pin to ground */
#define CY_CAPSENSE_GROUND                              (0u)
/** Connection of pin to High-Z */
#define CY_CAPSENSE_HIGHZ                               (1u)
/** Configuring of pin as a shield */
#define CY_CAPSENSE_SHIELD                              (2u)
/** Configuring of pin as a CSD sensor */
#define CY_CAPSENSE_SENSOR                              (3u)
/** Configuring of pin as a CSX Tx electrode */
#define CY_CAPSENSE_TX_PIN                              (4u)
/** Configuring of pin as a CSX Rx electrode */
#define CY_CAPSENSE_RX_PIN                              (5u)

