zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_common.h
#if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
    /** Configuring of pin as a negative Tx
     * \note This macro is available only for the fifth-generation CAPSENSE&trade; and  the fifth-generation low power
     * CAPSENSE&trade;
     */
    #define CY_CAPSENSE_NEGATIVE_TX_PIN                     (6u)
    /** Configuring of pin as an ISX Lx
     * \note This macro is available only for the fifth-generation CAPSENSE&trade; and  the fifth-generation low power
     * CAPSENSE&trade;
     */
    #define CY_CAPSENSE_ISX_LX_PIN                          (7u)
    /** Configuring of pin as an ISX Rx
     * \note This macro is available only for the fifth-generation CAPSENSE&trade; and  the fifth-generation low power
     * CAPSENSE&trade;
     */
    #define CY_CAPSENSE_ISX_RX_PIN                          (8u)
    /** Configuring of pin as an VDDA/2
     * \note This macro is available only for the fifth-generation CAPSENSE&trade; and  the fifth-generation low power
     * CAPSENSE&trade;
     */
    #define CY_CAPSENSE_VDDA2                               (9u)
#endif /* ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)) */

/** Pin is not connected to scanning bus */
#define CY_CAPSENSE_SNS_DISCONNECTED                    (0u)
/** Pin is connected to scanning bus */
#define CY_CAPSENSE_SNS_CONNECTED                       (1u)

/** Defines pin state as not controlled by / disconnected from MSCLP HW block */
#define CY_CAPSENSE_MSCLP_GPIO_MSC_ANA_DIS              (0u)
/** Defines pin state as controlled by / connected to MSCLP HW block */
#define CY_CAPSENSE_MSCLP_GPIO_MSC_ANA_EN               (1u)

/** \} */

/******************************************************************************/
/** \addtogroup group_capsense_macros_miscellaneous *//** \{ */
/******************************************************************************/
/** Defines the communication command complete bit mask */
#define CY_CAPSENSE_TU_CMD_COMPLETE_BIT                 (0x8000u)
/** Defines the status if restart was not performed in Cy_CapSense_RunTuner() */
#define CY_CAPSENSE_STATUS_RESTART_NONE                 (0x00u)
/** Defines the status if restart was done in Cy_CapSense_RunTuner() */
#define CY_CAPSENSE_STATUS_RESTART_DONE                 (0x01u)
#if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
    /** The size of the idac gain look-up table */
    #define CY_CAPSENSE_IDAC_GAIN_TABLE_SIZE            (7u)

    #if (CY_CAPSENSE_PLATFORM_DEVICE_PSOC4)
        #if (2u <= CY_IP_M0S8CSDV2_VERSION)
            /** Defines the number of supported idac gains for the CSDv2_ver2-based devices */
            #define CY_CAPSENSE_IDAC_GAIN_NUMBER        (7u)
        #else
            /** Defines the number of supported idac gains for the CSDv2_ver1-based devices */
            #define CY_CAPSENSE_IDAC_GAIN_NUMBER        (6u)
        #endif
    #else
        #define CY_CAPSENSE_IDAC_GAIN_NUMBER            (6u)
    #endif
#endif
/** 100% value */
#define CY_CAPSENSE_PERCENTAGE_100                      (100u)
/** An approximate duration in CPU cycles of the check loop with the software watchdog timer */
#define CY_CAPSENSE_APPROX_LOOP_DURATION                (5u)

/* Scope of scanning macros */
/** Widget scanning scope is a single sensor */
#define CY_CAPSENSE_SCAN_SCOPE_SNGL_SNS                 (0x0u)
/** Sensor scanning scope is a single widget */
#define CY_CAPSENSE_SCAN_SCOPE_ALL_SNS_MASK             (0x01u)
/** Widget scanning scope is all widgets */
#define CY_CAPSENSE_SCAN_SCOPE_ALL_WD_MASK              (0x02u)
/** Single slot scanning */
#define CY_CAPSENSE_SCAN_SNGL_SLOT                      (0x1u)
/** Multiple slot scanning */
#define CY_CAPSENSE_SCAN_MULTIPLE_SLOT                  (0x0u)


/** CAPSENSE&trade; related HW state is undefined */
#define CY_CAPSENSE_HW_CONFIG_UNDEFINED                 (0u)
/** CAPSENSE&trade; related HW is captured and configured to the default state */
#define CY_CAPSENSE_HW_CONFIG_CAPTURED_DEFAULT          (1u)
/** CAPSENSE&trade; related HW is configured to the standard regular scanning */
#define CY_CAPSENSE_HW_CONFIG_REGULAR_SCANNING          (2u)
/** CAPSENSE&trade; related HW is configured to execute the BIST functions */
#define CY_CAPSENSE_HW_CONFIG_BIST_FUNCTIONALITY        (3u)
/** CAPSENSE&trade; related HW is configured to the MPSC scanning */
#define CY_CAPSENSE_HW_CONFIG_MPSC_SCANNING             (4u)
/** CAPSENSE&trade; related HW is configured to execute a scan with the saturated channel */
#define CY_CAPSENSE_HW_CONFIG_CHANNEL_SATURATION        (5u)
/** CAPSENSE&trade; related HW is configured to the smart sense */
#define CY_CAPSENSE_HW_CONFIG_SMARTSENSE                (6u)
/** CAPSENSE&trade; related HW is configured to execute a scan to define CDAC dither parameters */
#define CY_CAPSENSE_HW_CONFIG_AUTO_DITHERING            (7u)
/** CAPSENSE&trade; related HW is configured to the WBX scanning */
#define CY_CAPSENSE_HW_CONFIG_WBX_SCANNING              (8u)

/** \} */


/******************************************************************************/
/** \addtogroup group_capsense_macros_bist *//** \{ */
/******************************************************************************/
/** The mask for a widget CRC test */
#define CY_CAPSENSE_BIST_CRC_WDGT_MASK                              ((uint32_t)CY_CAPSENSE_TST_WDGT_CRC_EN << 0uL)
/** The mask for a baseline integrity test */
#define CY_CAPSENSE_BIST_BSLN_INTEGRITY_MASK                        ((uint32_t)CY_CAPSENSE_TST_BSLN_INTEGRITY_EN << 1uL)
/** The mask for a rawcount integrity test */
#define CY_CAPSENSE_BIST_RAW_INTEGRITY_MASK                         ((uint32_t)CY_CAPSENSE_TST_RAW_INTEGRITY_EN << 2uL)
/** The mask for a pin integrity test */
#define CY_CAPSENSE_BIST_SNS_INTEGRITY_MASK                         ((uint32_t)CY_CAPSENSE_TST_SNS_SHORT_EN << 3uL)
/** The mask for a sensor capacitance measurement test */
#define CY_CAPSENSE_BIST_SNS_CAP_MASK                               ((uint32_t)CY_CAPSENSE_TST_SNS_CAP_EN << 4uL)
/** The mask for a shield capacitance measurement test */
#define CY_CAPSENSE_BIST_SHIELD_CAP_MASK                            ((uint32_t)CY_CAPSENSE_TST_SH_CAP_EN << 5uL)
/** The mask for an external capacitor capacitance measurement test */
#define CY_CAPSENSE_BIST_EXTERNAL_CAP_MASK                          ((uint32_t)CY_CAPSENSE_TST_EXTERNAL_CAP_EN << 6uL)
/** The mask for a VDDA measurement test */
#define CY_CAPSENSE_BIST_VDDA_MASK                                  ((uint32_t)CY_CAPSENSE_TST_VDDA_EN << 7uL)
/** The mask for an electrode capacitance measurement test */
#define CY_CAPSENSE_BIST_ELTD_CAP_MASK                              ((uint32_t)CY_CAPSENSE_TST_ELTD_CAP_EN << 8uL)

#if (CY_CAPSENSE_PLATFORM_BLOCK_FOURTH_GEN)
    /** The mask for all enabled self-test functions */
    #define CY_CAPSENSE_BIST_RUN_AVAILABLE_SELF_TEST_MASK           (CY_CAPSENSE_BIST_CRC_WDGT_MASK | \
                                                                     CY_CAPSENSE_BIST_SNS_INTEGRITY_MASK | \
                                                                     CY_CAPSENSE_BIST_SNS_CAP_MASK | \
                                                                     CY_CAPSENSE_BIST_EXTERNAL_CAP_MASK |\
                                                                     CY_CAPSENSE_BIST_VDDA_MASK |\
                                                                     CY_CAPSENSE_BIST_SHIELD_CAP_MASK)

    /** The mask for all enabled measurement self-test functions */
    #define CY_CAPSENSE_TST_MEASUREMENT_GROUP_EN                    (CY_CAPSENSE_BIST_EN && \
                                                                     (CY_CAPSENSE_TST_SNS_CAP_EN || \
                                                                      CY_CAPSENSE_TST_SH_CAP_EN ||\
                                                                      CY_CAPSENSE_TST_VDDA_EN ||\
                                                                      CY_CAPSENSE_TST_EXTERNAL_CAP_EN))

