zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_common.h
    /** The mask for all enabled self-test functions which changes HW configuration */
    #define CY_CAPSENSE_TST_HW_GROUP_EN                             (CY_CAPSENSE_BIST_EN && \
                                                                     (CY_CAPSENSE_TST_SNS_SHORT_EN ||\
                                                                      CY_CAPSENSE_TST_MEASUREMENT_GROUP_EN))
#elif (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN)
    /** The mask for all enabled self-test functions */
    #define CY_CAPSENSE_BIST_RUN_AVAILABLE_SELF_TEST_MASK           (CY_CAPSENSE_BIST_CRC_WDGT_MASK | \
                                                                     CY_CAPSENSE_BIST_SNS_INTEGRITY_MASK | \
                                                                     CY_CAPSENSE_BIST_SNS_CAP_MASK | \
                                                                     CY_CAPSENSE_BIST_ELTD_CAP_MASK | \
                                                                     CY_CAPSENSE_BIST_SHIELD_CAP_MASK)

    /** The mask for all enabled measurement self-test functions */
    #define CY_CAPSENSE_TST_MEASUREMENT_GROUP_EN                    (CY_CAPSENSE_BIST_EN && \
                                                                     (CY_CAPSENSE_TST_SNS_CAP_EN || \
                                                                      CY_CAPSENSE_TST_SH_CAP_EN ||\
                                                                      CY_CAPSENSE_TST_ELTD_CAP_EN))

    /** The mask for all enabled self-test functions which changes HW configuration */
    #define CY_CAPSENSE_TST_HW_GROUP_EN                             (CY_CAPSENSE_BIST_EN && \
                                                                     (CY_CAPSENSE_TST_SNS_SHORT_EN ||\
                                                                      CY_CAPSENSE_TST_MEASUREMENT_GROUP_EN))
#else
    /** The mask for all enabled self-test functions */
    #define CY_CAPSENSE_BIST_RUN_AVAILABLE_SELF_TEST_MASK           (CY_CAPSENSE_BIST_CRC_WDGT_MASK | \
                                                                     CY_CAPSENSE_BIST_SNS_INTEGRITY_MASK | \
                                                                     CY_CAPSENSE_BIST_SNS_CAP_MASK | \
                                                                     CY_CAPSENSE_BIST_ELTD_CAP_MASK | \
                                                                     CY_CAPSENSE_BIST_EXTERNAL_CAP_MASK |\
                                                                     CY_CAPSENSE_BIST_VDDA_MASK |\
                                                                     CY_CAPSENSE_BIST_SHIELD_CAP_MASK)

    /** The mask for all enabled measurement self-test functions */
    #define CY_CAPSENSE_TST_MEASUREMENT_GROUP_EN                    (CY_CAPSENSE_BIST_EN && \
                                                                     (CY_CAPSENSE_TST_SNS_CAP_EN || \
                                                                      CY_CAPSENSE_TST_SH_CAP_EN ||\
                                                                      CY_CAPSENSE_TST_ELTD_CAP_EN ||\
                                                                      CY_CAPSENSE_TST_VDDA_EN ||\
                                                                      CY_CAPSENSE_TST_EXTERNAL_CAP_EN))

    /** The mask for all enabled self-test functions which changes HW configuration */
    #define CY_CAPSENSE_TST_HW_GROUP_EN                             (CY_CAPSENSE_BIST_EN && \
                                                                     (CY_CAPSENSE_TST_SNS_SHORT_EN ||\
                                                                      CY_CAPSENSE_TST_MEASUREMENT_GROUP_EN))
#endif

#if ((CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN) || (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP))
    /** The estimated serial resistance value of the external capacitor charging/discharging
     * circuit including GPIO, AMuxBus, PCB and all another resistances. The value is used
     * for the external capacitor charging/discharging time estimations */
    #define CY_CAPSENSE_BIST_EXT_CAP_SERIAL_RESISTANCE              (1000u)
#endif

/** \} */


/******************************************************************************/
/** \addtogroup group_capsense_macros_status *//** \{ */
/******************************************************************************/
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: Successfully */
#define CY_CAPSENSE_STATUS_SUCCESS                      (0x00u)
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: Bad input parameter */
#define CY_CAPSENSE_STATUS_BAD_PARAM                    (0x01u)
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: Received wrong data */
#define CY_CAPSENSE_STATUS_BAD_DATA                     (0x02u)
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: Timeout */
#define CY_CAPSENSE_STATUS_TIMEOUT                      (0x04u)
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: Invalid state */
#define CY_CAPSENSE_STATUS_INVALID_STATE                (0x08u)
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: Bad configuration */
#define CY_CAPSENSE_STATUS_BAD_CONFIG                   (0x10u)
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: Overflow */
#define CY_CAPSENSE_STATUS_CONFIG_OVERFLOW              (0x20u)
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: HW is busy */
#define CY_CAPSENSE_STATUS_HW_BUSY                      (0x40u)
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: HW is locked */
#define CY_CAPSENSE_STATUS_HW_LOCKED                    (0x80u)
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: Unable to perform calibration */
#define CY_CAPSENSE_STATUS_CALIBRATION_FAIL             (0x100u)
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: CapDac calibration fail - The reference/fine CapDAC calibration stage is failed as the raw count minimum across widget is out of range */
#define CY_CAPSENSE_STATUS_CALIBRATION_REF_CHECK_FAIL   (0x200u)
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: CapDac calibration fail - The resulting rawcounts across all sensors in widget are out of defined range */
#define CY_CAPSENSE_STATUS_CALIBRATION_CHECK_FAIL       (0x400u)
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: Sense Clock Divider
*   is out of the valid range for the specified Clock source configuration
*/
#define CY_CAPSENSE_STATUS_BAD_CLOCK_CONFIG             (0x800u)
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: Used scan configuration
*   is not sufficient to accumulate at least one valid CIC2 sample.
*/
#define CY_CAPSENSE_STATUS_CIC2_ACC_UNDERFLOW           (0x1000u)

/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: Used scan configuration
*   leads to the overflow in the CIC2 accumulation register.
*/
#define CY_CAPSENSE_STATUS_CIC2_ACC_OVERFLOW            (0x2000u)
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: Unable to perform a scan when MPSC sensors and
*   other sense method sensors are located in the same frame
*/
#define CY_CAPSENSE_STATUS_MIXED_SENSORS                (0x4000u)
/** Return status \ref cy_capsense_status_t of CAPSENSE&trade; operation: Bad config for LLW */
#define CY_CAPSENSE_STATUS_LLW_BAD_CONFIG               (0x8000u)

/** State of Low Power sensor processing mask */
#define CY_CAPSENSE_LP_PROCESS_ENABLED_MASK             (0x1uL)

