zhanzr/cy8ckit-demo/app/mtb_shared/capsense/release-v10.0.0/cy_capsense_common.h
/** \} */

#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
    /* HW IIR Filter enable status for Active widgets */
    #define CY_CAPSENSE_RC_HW_IIR_FILTER_EN             (CY_CAPSENSE_REGULAR_RC_HW_IIR_FILTER_EN || \
                                                         CY_CAPSENSE_PROX_RC_HW_IIR_FILTER_EN)
#else
    #define CY_CAPSENSE_RC_HW_IIR_FILTER_EN             (0u)
#endif

/* Shift to 8 bits */
#define CY_CAPSENSE_BYTE_SHIFT                          (8u)

/* The time interval is required for settling analog part of the HW block. */
#define CY_CAPSENSE_ANALOG_SETTLING_TIME_US             (25u)

#if (CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP)
/* The time interval in us is required for settling analog part of the MSCLP HW block. */
#define CY_CAPSENSE_MSCLP_HW_SETTLING_TIME_US           (10u)

/*  The Sequencer FSM Operating Mode,
*   to be used with cy_stc_capsense_internal_context_t::operatingMode
*/
#define CY_CAPSENSE_MODE_CPU                            (0x0u) /* The regular (interrupt-driven) CPU mode */
#define CY_CAPSENSE_MODE_AS_MS                          (0x2u) /* The Autonomous-Scan Multi-Sensor Mode */
#define CY_CAPSENSE_MODE_LP_AOS                         (0x3u) /* The Low Power Always-On-Scanning Mode */

#endif /* CY_CAPSENSE_PLATFORM_BLOCK_FIFTH_GEN_LP */

#define CY_CAPSENSE_BYTES_IN_16_BITS                    (2uL)
#define CY_CAPSENSE_BYTE_IN_32_BIT                      (4uL)
#define CY_CAPSENSE_CONVERSION_MEGA                     (1000000u)
#define CY_CAPSENSE_CONVERSION_KILO                     (1000u)
#define CY_CAPSENSE_CONVERSION_HECTO                    (100u)
#define CY_CAPSENSE_CONVERSION_DEKA                     (10u)
#define CY_CAPSENSE_DIVIDER_TWO                         (2u)
#define CY_CAPSENSE_32_BIT_MASK                         (0xFFFFFFFFu)
#define CY_CAPSENSE_25_BIT_MASK                         (0x01FFFFFFu)
#define CY_CAPSENSE_16_BIT_MASK                         (0xFFFFu)
#define CY_CAPSENSE_14_BIT_MASK                         (0x3FFFu)

/*
* These defines are obsolete and kept for backward compatibility only.
* They will be removed in the future versions.
*/
#define CY_CAPSENSE_MDW_VERSION_MAJOR                   (CY_CAPSENSE_MW_VERSION_MAJOR)
#define CY_CAPSENSE_MDW_VERSION_MINOR                   (CY_CAPSENSE_MW_VERSION_MINOR)
#define CY_CAPSENSE_MDW_ID                              (CY_CAPSENSE_ID)
#define CY_CAPSENSE_SW_STS_BUSY                         (CY_CAPSENSE_BUSY)

/* CAPSENSE IMO clock values in MHz */
#define CY_CAPSENSE_IMO_CLK_25_MHZ                      (25u)
#define CY_CAPSENSE_IMO_CLK_38_MHZ                      (38u)
#define CY_CAPSENSE_IMO_CLK_46_MHZ                      (46u)

#if defined(CY_IP_M0S8MSCV3LP)
    /* CAPSENSE MRSS IMO frequency value */
    #if (CY_CAPSENSE_IMO_FREQUENCY == CY_CAPSENSE_IMO_25_MHZ)
        #define CY_CAPSENSE_MOD_CLOCK_MHZ   CY_CAPSENSE_IMO_CLK_25_MHZ
    #elif (CY_CAPSENSE_IMO_FREQUENCY == CY_CAPSENSE_IMO_38_MHZ)
        #define CY_CAPSENSE_MOD_CLOCK_MHZ   CY_CAPSENSE_IMO_CLK_38_MHZ
    #else /* (CY_CAPSENSE_IMO_FREQUENCY == CY_CAPSENSE_IMO_46_MHZ) */
        #define CY_CAPSENSE_MOD_CLOCK_MHZ   CY_CAPSENSE_IMO_CLK_46_MHZ
    #endif
#endif /* CY_IP_M0S8MSCV3LP */

#if defined(__cplusplus)
}
#endif

#endif /* (defined(CY_IP_MXCSDV2) || defined(CY_IP_M0S8CSDV2) || defined(CY_IP_M0S8MSCV3) || defined(CY_IP_M0S8MSCV3LP)) */

#endif /* CY_CAPSENSE_COMMON_H */


/* [] END OF FILE */
